In [38]:
import pandas as pd

In [39]:
users = pd.read_csv('main/BX-CSV-Dump/BX-Users.csv', sep=';', quotechar="\"", escapechar="\\", encoding='latin_1')

In [40]:
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [41]:
books = pd.read_csv('main/BX-CSV-Dump/BX-Books.csv',  sep=';', quotechar="\"", escapechar="\\", encoding='latin_1')

In [42]:
books.tail()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
271374,0440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm),http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...,http://images.amazon.com/images/P/0440400988.0...
271375,0525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...,http://images.amazon.com/images/P/0525447644.0...
271376,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...,http://images.amazon.com/images/P/006008667X.0...
271377,0192126040,Republic (World's Classics),Plato,1996,Oxford University Press,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...,http://images.amazon.com/images/P/0192126040.0...
271378,0767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...,http://images.amazon.com/images/P/0767409752.0...

In [43]:
book_ratings = pd.read_csv('main/BX-CSV-Dump/BX-Book-Ratings.csv', sep=';', quotechar='\"', escapechar='\\', encoding='latin_1')

In [44]:
book_ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [45]:
import pymysql

0

In [94]:
cursor.execute('select * from main_book')

23

In [82]:
cursor.fetchall()

((1, 'a', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (2, 'd', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (3, 'a', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (4,
  'gdsafds',
  'a',
  'no-name',
  'default',
  'default',
  'default',
  'default',
  9999),
 (5, 'rew', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (6, 'a', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (7, 'a', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (8, 'a', 'a', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (9,
  'a',
  'a3dfsafsa',
  'no-name',
  'default',
  'default',
  'default',
  'default',
  9999),
 (10,
  'a',
  'a3dfsafsa',
  'no-name',
  'default',
  'default',
  'default',
  'default',
  9999),
 (11, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (12, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (13, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (14, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (15, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (16, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (17, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (18, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (19, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (20, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (21, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (22, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999),
 (23, '', '', 'no-name', 'default', 'default', 'default', 'default', 9999))

In [51]:
books.head(n=1)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...

In [52]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [53]:
books.shape[1]

8

In [70]:
type(books.loc[271378]['Year-Of-Publication'])

numpy.int64

In [104]:
db = pymysql.connect('localhost', 'root', 'password', 'books_recommend',charset='utf8')
cursor = db.cursor()

0

In [105]:
for i in range(1, 10):
    book = books.loc[i]
    sql = 'insert into main_book(isbn, title, author, published_year, publisher, image_url) values(%s, %s, %s, %s, %s, %s)'
    cursor.execute(sql, (book['ISBN'], 
                         book['Book-Title'],
                         book['Book-Author'],
                         str(book['Year-Of-Publication']),
                         book['Publisher'],
                         book['Image-URL-L']))
    db.commit()
    print(i)

1
2
3
4
5
6
7
8
9

In [108]:
cursor.close()
db.close()

Error: Already closed

In [109]:
users.tail()

        User-ID                            Location   Age
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

In [110]:
book_ratings.tail()

         User-ID         ISBN  Book-Rating
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8